dataOF/ddv0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-011;
        relTol          0.1;
    }

    
    chargeDensity
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.2;
    }
    
    potentialDifference
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 5;
    

    residualControl
    {
        p               1e-4;
        U               1e-4;
        chargeDensity	1e-4;
        potentialDifference	1e-4;
    }
}


relaxationFactors
{
    fields
    {
        p               0.8;
        potentialDifference	0.75;
    }
    equations
    {
        U               0.6;
        
        chargeDensity	0.65; // Seems best range and very important for stability
    }
}


// ************************************************************************* //
