dataOF/ddv0/system/residualFunctions
// -*- C++ -*-
residualFunctions
    {
        // Mandatory entries (unmodifiable)
        type            solverInfo;
        libs            (utilityFunctionObjects);

        // Mandatory entries (runtime modifiable)
        fields          (p U potentialDifference chargeDensity);

        // Optional entries (runtime modifiable)
        writeResidualFields true;

    }


// ************************************************************************* //
